# HACKER RANK
## Problem: Weather Observation Station 16
Class: Easy

Source: https://www.hackerrank.com/challenges/weather-observation-station-16/problem?isFullScreen=true

## Description
Query the smallest Northern Latitude (LAT_N) from STATION that is greater than 38.7780. Round your answer to decimal places.

Input Format

The STATION table is described as follows:

![image](https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg)

where LAT_N is the northern latitude and LONG_W is the western longitude.

## Importing

In [2]:
import pandas as pd
from pandasql import sqldf

## Define Schema

In [3]:
# Create a list of tuples with the data
data = [
[794, 'Kissee Mills', 'MO', 139.6503652000, 73.4160988400],
[824, 'Loma Mar', 'CA', 48.6978857200, 130.5393541000],
[603, 'Sandy Hook,' 'CT', 72.3374801400, 148.2400769000],
[478, 'Tipton', 'IN', 33.5479270100, 97.9428603600],
[619, 'Arlington', 'CO', 75.1799307900, 92.9461589400],
[711, 'Turner', 'AR', 50.2438053400, 101.4580163000],
[839, 'Slidell', 'LA', 85.3227030400, 151.8743276000],
[411, 'Negreet', 'LA', 98.9707194000, 105.3376115000],
[588, 'Glencoe', 'KY', 46.3873924400, 136.0427027000],
]

columns = ['ID', 'CITY', 'STATE', 'LAT_N', 'LONG_W']

df = pd.DataFrame(data, columns=columns)

df

    ID           CITY     STATE       LAT_N      LONG_W
0  794   Kissee Mills        MO  139.650365   73.416099
1  824       Loma Mar        CA   48.697886  130.539354
2  603  Sandy Hook,CT  72.33748  148.240077         NaN
3  478         Tipton        IN   33.547927   97.942860
4  619      Arlington        CO   75.179931   92.946159
5  711         Turner        AR   50.243805  101.458016
6  839        Slidell        LA   85.322703  151.874328
7  411        Negreet        LA   98.970719  105.337611
8  588        Glencoe        KY   46.387392  136.042703

## Task

In [4]:
# Define the SQL query
query = """
SELECT ROUND(LAT_N, 4)
FROM STATION 
WHERE LAT_N > 38.7780
ORDER BY LAT_N ASC
LIMIT 1
;
"""

# Excute the query using pandasql
result = sqldf(query, env={'STATION':df})

# Display the result dataframe
display(result)

   ROUND(LAT_N, 4)
0          46.3874